docs/linux/gentoo/nvidia/optimus/2019/04/22/gentoo-nvidia-optimus.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-23 Tue 23:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nvidia Optimus: Switch on Boot</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://gongzhitaao.org/orgcss/org.css" type="text/css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.10.0/styles/googlecode.min.css" />
</head>
<body>
<div id="preamble" class="status">
<a href="/about.html">about</a>
</div>
<div id="content">
<h1 class="title">Nvidia Optimus: Switch on Boot</h1>
<p>
/etc/init.d/enable-nvidia:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">!/sbin/</span><span class="org-keyword">openrc-run</span>

<span class="org-function-name">depend</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
        need localmount
        before xdm
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-function-name">start</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-keyword">if</span> dmesg | grep <span class="org-string">'Command line'</span> | grep -q <span class="org-string">'enable_nvidia=true'</span> ; <span class="org-keyword">then</span>

        <span class="org-builtin">test</span> -f /etc/modprobe.d/blacklist-nvidia.conf &amp;&amp; rm /etc/modprobe.d/blacklist-nvidia.conf

        modprobe -q nvidia
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span><span class="org-rainbow-delimiters-depth-3">[</span> $<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-sh-quoted-exec">eselect</span> opengl show<span class="org-rainbow-delimiters-depth-4">)</span> <span class="org-negation-char">!</span>= nvidia <span class="org-rainbow-delimiters-depth-3">]</span><span class="org-rainbow-delimiters-depth-2">]</span> ; <span class="org-keyword">then</span>
                eselect opengl set nvidia &amp;&gt;/dev/null
        <span class="org-keyword">fi</span>
        cp /etc/X11/xorg.conf_working_nvidia /etc/X11/xorg.conf

  <span class="org-keyword">else</span>
        <span class="org-builtin">echo</span> -e <span class="org-string">"install nvidia /bin/false\ninstall nvidia_modeset /bin/false\ninstall nvidia_drm /bin/false"</span> &gt; /etc/modprobe.d/blacklist-nvidia.conf

        rmmod nvidia_drm || :
        rmmod nvidia_modeset || :
        rmmod nvidia || :

        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -f /etc/X11/xorg.conf <span class="org-rainbow-delimiters-depth-2">]</span> ; <span class="org-keyword">then</span>
                rm /etc/X11/xorg.conf
        <span class="org-keyword">fi</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span><span class="org-rainbow-delimiters-depth-3">[</span> $<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-sh-quoted-exec">eselect</span> opengl show<span class="org-rainbow-delimiters-depth-4">)</span> <span class="org-negation-char">!</span>= xorg-x11 <span class="org-rainbow-delimiters-depth-3">]</span><span class="org-rainbow-delimiters-depth-2">]</span> ; <span class="org-keyword">then</span>
                eselect opengl set xorg-x11 &amp;&gt;/dev/null
        <span class="org-keyword">fi</span>

  <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
/usr/share/sddm/scripts/Xsetup:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">!/bin/</span><span class="org-keyword">sh</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Xsetup - run as root before the login dialog appears</span>

<span class="org-keyword">if</span> dmesg | grep <span class="org-string">'Command line'</span> | grep -q <span class="org-string">'enable_nvidia=true'</span> ; <span class="org-keyword">then</span>
    xrandr --setprovideroutputsource modesetting NVIDIA-0
    xrandr --auto
<span class="org-keyword">fi</span>
</pre>
</div>

<p>
/etc/X11/xorg.conf_working_nvidia:
</p>
<div class="org-src-container">
<pre class="src src-sh">Section <span class="org-string">"Files"</span>
  ModulePath <span class="org-string">"/usr/lib/opengl/nvidia"</span>
  ModulePath <span class="org-string">"/usr/lib32/opengl/nvidia"</span>
  ModulePath <span class="org-string">"/usr/lib32/xorg/modules"</span>
  ModulePath <span class="org-string">"/usr/lib64/opengl/nvidia/xorg"</span>
  ModulePath <span class="org-string">"/usr/lib64/xorg/modules"</span>
EndSection

Section <span class="org-string">"ServerLayout"</span>
  Identifier <span class="org-string">"layout"</span>
  Screen 1 <span class="org-string">"nvidia"</span>
  Inactive <span class="org-string">"intel"</span>
EndSection

Section <span class="org-string">"Device"</span>
  Identifier <span class="org-string">"nvidia"</span>
  Driver <span class="org-string">"nvidia"</span>
  BusID <span class="org-string">"PCI:2:0:0"</span>
EndSection

Section <span class="org-string">"Screen"</span>
  Identifier <span class="org-string">"nvidia"</span>
  Device <span class="org-string">"nvidia"</span>
  <span class="org-comment-delimiter">#</span><span class="org-comment">Option "AllowEmptyInitialConfiguration" "Yes"</span>
  <span class="org-comment-delimiter">#</span><span class="org-comment">Option "UseDisplayDevice" "none"</span>
EndSection

Section <span class="org-string">"Device"</span>
  Identifier <span class="org-string">"intel"</span>
  Driver <span class="org-string">"modesetting"</span>
  Option <span class="org-string">"AccelMethod"</span> <span class="org-string">"none"</span>
EndSection

Section <span class="org-string">"Screen"</span>
  Identifier <span class="org-string">"intel"</span>
  Device <span class="org-string">"intel"</span>
EndSection
</pre>
</div>
</div>
<div id="postamble" class="status">
2021
</div>
</body>
</html>
